<?php

$_FARCH_ERRORS = array(
"EMPTY_FOTOTAG_ADD" => "Пустой тэг. Такой пустой тэг нельзя добавить",
"BAD_COLOR_FORMAT" => "Некорректно задан цвет. Следует указать цвет в формате RRGGBB",

"NO_SUCH_FOTO_ID" => "Нет такого фото",

"UNKNOWN_ACTION" => "Неизвестное действие",

'EMPTY_ALBUM_NAME' => "Пустое название альбома",
'TREE_ERROR' => "Недопустимая операция с деревом альбомов"

);

$_FARCH_FOTO_ERRORS = Array(
'DB_ERROR' => "Ошибка при регистрации изображения в базе данных",
'DB_ERROR2' => "Ошибка при подтверждении регистрации изображения в базе данных",
'BAD_FILE' => "Ошибочный файл",
'POSSIBLE_NOT_ENOUGH_MEM' => "Возможно, недостаточно памяти для обработки изображения",
'BAD_IMAGE_TYPE' => "Неизвестный или неразрешенный типа изображения",
'CANT_READ_IMAGE' => "Не удалось открыть изображение",
'CANT_CREATE_DIRS' => "Не удалось создать директорию для изображений",
'CANT_COPY_FILE' => "Не удалось скопировать оригинальный файл",
'UNKNOWN_RESIZE_METHOD' => "В конфигурации указан неизвестный метод уменьшения изображения",
'CANT_SAVE_PREVIEW' => "Не удалось сохранить превью",
'CANT_CHANGE_ALT_TEXT' => "Не удалось изменить текст фотографии",
'CANT_DELETE_PHOTOS' => "Не удалось удалить фотографии"
);

$_FARCH_FOTO_MESSAGES = Array(
"SUCCESSFUL_UPLOAD" => "Фотографии успешно загружены"
);

?>