<?php

return array(
'BAD_EMAIL' => 'Incorrect email address.',
'BAD_PHONE' => 'Incorrect phone number.',
'EMPTY_PHONE' => 'Empty phone number.',
'NO_CONTACTS' => 'No contact info.',
'OTHER_ERROR' => 'Произошла техническая ошибка, форма не может быть принята. Если у вас есть возможность, сообщите об этом администратору сайта. Спасибо!',
'EMAIL_NOT_SENT' => "По техническим причинам, письмо не может быть отправлено. Попробуйте повторить попытку позже, или свяжитесь с нами другим способом.",
'NO_TEXT' => "Вы не ввели сообщение.",
'PROBABLY_SPAM' => "Наш сервер считает, что вы не человек, а робот, поэтому ваше письмо не отправлено. Если вы &mdash; человек, то примите наши извинения за эту ошибку. Сами понимаете, без антиспама сейчас никуда, а иногда он принимает неправильные решения."
);

?>